// 1 - При каждом клике на кнопку Add должна появляться
// новая кнопка со случайным текстом (например цифровым id) При клике на появившуюся кнопку она должна удаляться.

// 2 - Есть два input name и phone. При нажатии на кнопку Add должен добавляться контакт с именем и номером в список контактов
// Добавить возможность удалять контакты

export function Buttons() {
  // 1
  return (
    <div>
      <button>ADD</button>
    </div>
  )

  // // 2
  // return (
  //   <div>
  //     <h1>Contacts list</h1>
  //     <input />
  //     <input />
  //     <button>Add</button>
  //     <ul></ul>
  //   </div>
  // )
}
